dicts_station = {
    'DGG': {
        'name': '东港',
        'lat': 39.8333,
        'lng': 124.1667
    },
    'LHT': {
        'name': '老虎滩',
        'lat': 38.8667,
        'lng': 121.6833
    },
    'BYQ': {
        'name': '鲅鱼圈',
        'lat': 40.3,
        'lng': 122.0833
    },
    'HLD': {
        'name': '葫芦岛',
        'lat': 40.7167,
        'lng': 119.6167
    },
    'TGU': {
        'name': '塘沽',
        'lat': 38.9378,
        'lng': 117.8261
    },
    'CFD': {
        'name': '曹妃甸',
        'lat': 38.9333,
        'lng': 118.5
    },
    'HHA': {
        'name': '黄骅',
        'lat': 38.316,
        'lng': 117.8667
    },
    'WFG': {
        'name': '潍坊',
        'lat': 37.2333,
        'lng': 119.1833
    },
    'PLI': {
        'name': '蓬莱',
        'lat': 37.8333,
        'lng': 120.6167
    },
    'CST': {
        'name': '成山头',
        'lat': 37.3833,
        'lng': 122.7
    },
}

dicts_name_code = {
    # '东港': 'DGG',
    # '老虎滩': 'LHT',
    # '鲅鱼圈': 'BYQ',
    # '葫芦岛': 'HLD',
    # '塘沽': 'TGU',
    # '曹妃甸': 'CFD',
    # '黄骅': 'HHA',
    # '潍坊': 'WFG',
    # '蓬莱': 'PLI',
    # '成山头': 'CST',
    '东营港': 'DYG',
    '秦皇岛': 'QHD',
}
